#ifndef _NX_NWN_STRUCT_CSERVEREXOAPPCONFIG_
#define _NX_NWN_STRUCT_CSERVEREXOAPPCONFIG_

struct CServerExoAppConfig_s {
	uint32_t					field_0;
	uint32_t					field_4;
	uint32_t					field_8;
	uint32_t					field_C;
	uint32_t					field_10;
	uint32_t					field_14;
	uint32_t					field_18;
	uint32_t					field_1C;
	uint32_t					field_20;
	uint32_t					field_24;
	uint32_t					field_28;
	uint32_t					field_2C;
	uint32_t					field_30;
	uint32_t					field_34;
	uint32_t					field_38;
	uint32_t					field_3C;
	uint32_t					field_40;
	uint32_t					field_44;
	uint32_t					field_48;
	uint32_t					field_4C;
	uint32_t					field_50;
	uint32_t					field_54;
	uint32_t					field_58;
	uint32_t					field_5C;
	uint32_t					field_60;
	uint32_t					field_64;
	uint32_t					field_68;
	uint32_t					field_6C;
	uint32_t					field_70;
	uint32_t					field_74;
	uint32_t					field_78;
	uint32_t					field_7C;
	uint32_t					field_80;
	uint32_t					field_84;
	uint32_t					field_88;
	uint32_t					field_8C;
	uint32_t					field_90;
	uint32_t					field_94;
	uint32_t					field_98;
	uint32_t					field_9C;
	uint32_t					max_players;//A0
	uint32_t					field_A4;
	uint32_t					field_A8;
	uint32_t					field_AC;
	uint32_t					min_lvl;//B0
	uint32_t					max_lvl;//B4
	uint32_t					allow_local_chars;//BC
	uint32_t					field_BC;
	uint32_t					field_C0;
	uint32_t					field_C4;
	uint32_t					field_C8;
	uint32_t					field_CC;
	uint32_t					field_D0;
	uint32_t					field_D4;
	uint32_t					field_D8;
	uint32_t					field_DC;
	uint32_t					field_E0;
	uint32_t					pvp_setting;//E4
	uint32_t					pause_n_play;//E8
	uint32_t					one_party;//EC
	uint32_t					enforce_legal_chars;//F0
	uint32_t					item_lvl_restriction;//F4
	uint32_t					cd_banned_behavior;//F8
	uint32_t					disallow_shouting;//FC
	uint32_t					show_dm_joined;//100
	uint32_t					backup_saved_chars;//104
	uint32_t					autofailure_on_1;//108
	uint32_t					validate_spells;//10C
	uint32_t					examine_effects;//110
	uint32_t					examine_cr;//114
	uint32_t					max_hit_points;//118
	uint32_t					restore_spelluses;//11C
	uint32_t					reset_encounters;//120
	uint32_t					hide_hit_points_gained;//124
	uint32_t					field_128;
	uint32_t					field_12C;
	uint32_t					field_130;
	uint32_t					field_134;
	uint32_t					field_138;
	uint32_t					field_13C;
	uint32_t					field_140;
	uint32_t					field_144;
	uint32_t					autosave_interval;//148
	uint32_t					vault_characters_only;//14C //untested, copied from linux api - should be enabled when local vault is disabled
	uint32_t					save_chars_in_save_game;//150 //untested, copied from linux api - should be enabled when local vault is enabled
	uint32_t					suppress_base_servervault;//154
	uint32_t					game_region;//158
	uint32_t					field_15C;
	uint32_t					field_160;
	uint32_t					game_type;//164
	uint32_t					field_168;
	uint32_t					field_16C;
	uint32_t					game_diff;//170
};

#endif